Revit 2027 API
BasePoint.IsShared Property
 Indicates whether the BasePoint is shared. The project's survey point is a BasePoint which is shared.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsShared { get; }
Public ReadOnly Property IsShared As Boolean
	Get
public:
property bool IsShared {
	bool get ();
}
member IsShared : bool with get
Property Value
Boolean
See Also
Reference
BasePoint Class
Autodesk.Revit.DB Namespace